KozhinovAlexander/zephyr_vscode_workspace/stm32_svd/STM32L471.svd
            <register>
               <name>FS_GINTMSK</name>
               <displayName>FS_GINTMSK</displayName>
               <description>OTG_FS interrupt mask register           (OTG_FS_GINTMSK)</description>
               <addressOffset>0x18</addressOffset>
               <size>0x20</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>MMISM</name>
                     <description>Mode mismatch interrupt               mask</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OTGINT</name>
                     <description>OTG interrupt mask</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SOFM</name>
                     <description>Start of frame mask</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>RXFLVLM</name>
                     <description>Receive FIFO non-empty               mask</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>NPTXFEM</name>
                     <description>Non-periodic TxFIFO empty               mask</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GINAKEFFM</name>
                     <description>Global non-periodic IN NAK effective               mask</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>GONAKEFFM</name>
                     <description>Global OUT NAK effective               mask</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ESUSPM</name>
                     <description>Early suspend mask</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBSUSPM</name>
                     <description>USB suspend mask</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>USBRST</name>
                     <description>USB reset mask</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ENUMDNEM</name>
                     <description>Enumeration done mask</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>ISOODRPM</name>
                     <description>Isochronous OUT packet dropped interrupt               mask</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EOPFM</name>
                     <description>End of periodic frame interrupt               mask</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>EPMISM</name>
                     <description>Endpoint mismatch interrupt               mask</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IEPINT</name>
                     <description>IN endpoints interrupt               mask</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>OEPINT</name>
                     <description>OUT endpoints interrupt               mask</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IISOIXFRM</name>
                     <description>Incomplete isochronous IN transfer               mask</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>IPXFRM_IISOOXFRM</name>
                     <description>Incomplete periodic transfer mask(Host               mode)/Incomplete isochronous OUT transfer mask(Device               mode)</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PRTIM</name>
                     <description>Host port interrupt mask</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-only</access>
                  </field>
                  <field>
                     <name>HCIM</name>
                     <description>Host channels interrupt               mask</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>PTXFEM</name>
                     <description>Periodic TxFIFO empty mask</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>CIDSCHGM</name>
                     <description>Connector ID status change               mask</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>DISCINT</name>
                     <description>Disconnect detected interrupt               mask</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>SRQIM</name>
                     <description>Session request/new session detected               interrupt mask</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
                  <field>
                     <name>WUIM</name>
                     <description>Resume/remote wakeup detected interrupt               mask</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <access>read-write</access>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_GRXSTSR_Device</name>
               <displayName>FS_GRXSTSR_Device</displayName>
               <description>OTG_FS Receive status debug read(Device           mode)</description>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FRMNUM</name>
                     <description>Frame number</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_GRXSTSR_Host</name>
               <displayName>FS_GRXSTSR_Host</displayName>
               <description>OTG_FS Receive status debug read(Host           mode)</description>
               <alternateRegister>FS_GRXSTSR_Device</alternateRegister>
               <addressOffset>0x1C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>EPNUM</name>
                     <description>Endpoint number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BCNT</name>
                     <description>Byte count</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>DPID</name>
                     <description>Data PID</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PKTSTS</name>
                     <description>Packet status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>FRMNUM</name>
                     <description>Frame number</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_GRXFSIZ</name>
               <displayName>FS_GRXFSIZ</displayName>
               <description>OTG_FS Receive FIFO size register           (OTG_FS_GRXFSIZ)</description>
               <addressOffset>0x24</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>RXFD</name>
                     <description>RxFIFO depth</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_GNPTXFSIZ_Device</name>
               <displayName>FS_GNPTXFSIZ_Device</displayName>
               <description>OTG_FS non-periodic transmit FIFO size           register (Device mode)</description>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>TX0FSA</name>
                     <description>Endpoint 0 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TX0FD</name>
                     <description>Endpoint 0 TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_GNPTXFSIZ_Host</name>
               <displayName>FS_GNPTXFSIZ_Host</displayName>
               <description>OTG_FS non-periodic transmit FIFO size           register (Host mode)</description>
               <alternateRegister>FS_GNPTXFSIZ_Device</alternateRegister>
               <addressOffset>0x28</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>NPTXFSA</name>
                     <description>Non-periodic transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NPTXFD</name>
                     <description>Non-periodic TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_GNPTXSTS</name>
               <displayName>FS_GNPTXSTS</displayName>
               <description>OTG_FS non-periodic transmit FIFO/queue           status register (OTG_FS_GNPTXSTS)</description>
               <addressOffset>0x2C</addressOffset>
               <size>0x20</size>
               <access>read-only</access>
               <resetValue>0x00080200</resetValue>
               <fields>
                  <field>
                     <name>NPTXFSAV</name>
                     <description>Non-periodic TxFIFO space               available</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>NPTQXSAV</name>
                     <description>Non-periodic transmit request queue               space available</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>NPTXQTOP</name>
                     <description>Top of the non-periodic transmit request               queue</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_GCCFG</name>
               <displayName>FS_GCCFG</displayName>
               <description>OTG_FS general core configuration register           (OTG_FS_GCCFG)</description>
               <addressOffset>0x38</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PWRDWN</name>
                     <description>Power down</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBUSASEN</name>
                     <description>Enable the VBUS sensing               device</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>VBUSBSEN</name>
                     <description>Enable the VBUS sensing               device</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFOUTEN</name>
                     <description>SOF output enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_CID</name>
               <displayName>FS_CID</displayName>
               <description>core ID register</description>
               <addressOffset>0x3C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x00001000</resetValue>
               <fields>
                  <field>
                     <name>PRODUCT_ID</name>
                     <description>Product ID field</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_HPTXFSIZ</name>
               <displayName>FS_HPTXFSIZ</displayName>
               <description>OTG_FS Host periodic transmit FIFO size           register (OTG_FS_HPTXFSIZ)</description>
               <addressOffset>0x100</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000600</resetValue>
               <fields>
                  <field>
                     <name>PTXSA</name>
                     <description>Host periodic TxFIFO start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>PTXFSIZ</name>
                     <description>Host periodic TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_DIEPTXF1</name>
               <displayName>FS_DIEPTXF1</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF2)</description>
               <addressOffset>0x104</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFO2 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_DIEPTXF2</name>
               <displayName>FS_DIEPTXF2</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF3)</description>
               <addressOffset>0x108</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFO3 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FS_DIEPTXF3</name>
               <displayName>FS_DIEPTXF3</displayName>
               <description>OTG_FS device IN endpoint transmit FIFO size           register (OTG_FS_DIEPTXF4)</description>
               <addressOffset>0x10C</addressOffset>
               <size>0x20</size>
               <access>read-write</access>
               <resetValue>0x02000400</resetValue>
               <fields>
                  <field>
                     <name>INEPTXSA</name>
                     <description>IN endpoint FIFO4 transmit RAM start               address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>INEPTXFD</name>
                     <description>IN endpoint TxFIFO depth</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
